# HasColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudInstance..::..HasColor Method
PointCloudInstance Class See Also
---
Returns true if at least one scan of the element have color, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool HasColor()
```

Visual Basic
---
```text
Public Function HasColor As Boolean
```

Visual C++
---
```text
public:
bool HasColor()
```

# ### Return Value
True if at least one scan of the element have color, false otherwise.
# See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace